html/org_spotify_player.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-26 Sat 11:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Spotify Player</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Lato:ital,wght@0,400;0,700;1,400&display=swap" rel="stylesheet">
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<header>
    <script src="setup-initial-theme.js"></script>
    <nav style="display: flex; justify-content: space-between; align-items: center;">
        <a href="/" style="color: inherit; text-decoration: none;">ketan.me</a>
        <ul style="display: flex; list-style-type: none; padding: 0; margin: 0;">
            <li style="margin-left: 1rem;"><a href="/blog.html">blog</a></li>
            <li style="margin-left: 1rem;"><a href="/thoughts.html">thoughts</a></li>
            <li style="margin-left: 1rem;"><a href="/experiments.html">garden</a></li>
            <li style="margin-left: 1rem;"><input type="checkbox" id="theme-switcher">
                <label id="theme-switcher-label" for="theme-switcher"></label>
            </li>
        </ul>
    </nav>
</header>
</div>
<div id="content" class="content">
<h1 class="title">Org Spotify Player
<br />
<span class="subtitle">Last tended to on May 25, 2022</span>
</h1>
<p>
Prerequisites: MacOS &amp; spotify.<br />
</p>

<p>
NOTE: be careful adding code links &#x2013; org-link-shell-confirm-function is set to nil just for this buffer, meaning that links in this buffer will execute without warning once you follow the link. (You can verify the code inside these links is not malicious with <code>org-toggle-link-display</code>)<br />
</p>

<p>
Eventually: want to create a spotify: link type so that u can just do stuff like &ldquo;album:[ID]&rdquo;<br />
</p>

<p>
<a href="shell:osascript%20-e%20'tell%20application%20%22Spotify%22%20to%20previous%20track'">prev track</a> · <a href="shell:osascript%20-e%20'tell%20application%20%22Spotify%22%20to%20playpause'">play/pause</a> · <a href="shell:osascript%20-e%20'tell%20application%20%22Spotify%22%20to%20next%20track'">next track</a><br />
</p>

<p>
ideas: have just a big list of songs/albums and stuff that I love. Give stuff various tags, like for genre, playlists, Then you can use org-ql, or what have you to filter the music, and voila, you have a dynamically generated playlist.<br />
</p>

<p>
<a href="https://open.spotify.com/album/71QyofYesSsRMwFOTafnhB">Coloring Book</a><br />
</p>

<p>
<a href="https://open.spotify.com/track/0aMHIW1lqrulVCx0LLlr6a">Cocoa Butter Kisses</a><br />
</p>

<p>
<a href="https://open.spotify.com/playlist/37i9dQZF1DXdgnLr18vPvu">Tailgate Party</a><br />
</p>

<p>
<a href="https://open.spotify.com/playlist/37i9dQZF1DX1gRalH1mWrP">Summer Hits</a><br />
</p>

<p>
<a href="https://open.spotify.com/playlist/4hckm1aSpJtD9CebeTweAB">Energetic Jazz</a><br />
</p>

<p>
<a href="https://open.spotify.com/track/7DJsL4jyXA39GDiHFQYQ0t">Mess Around</a><br />
</p>

<p>
<a href="https://open.spotify.com/album/1atjqOZTCdrjxjMyCPZc2g">Mr. Morale &amp; The Big Steppers</a><br />
</p>

<p>
<a href="https://open.spotify.com/album/1atjqOZTCdrjxjMyCPZc2g">Mr. Morale &amp; The Big Steppers</a><br />
</p>
<div id="outline-container-org7bae9bd" class="outline-2">
<h2 id="org7bae9bd">Water</h2>
<div class="outline-text-2" id="text-org7bae9bd">
</div>
<div id="outline-container-org1ecd1bb" class="outline-3">
<h3 id="org1ecd1bb"><a href="https://open.spotify.com/track/4VtRHZ4tBDHaWltVAytlLY">go</a></h3>
</div>
<div id="outline-container-orgfa07863" class="outline-3">
<h3 id="orgfa07863"><a href="https://open.spotify.com/track/7hfi4ZTfV7akmGINh6qYCF">Be</a></h3>
</div>
<div id="outline-container-org8200d52" class="outline-3">
<h3 id="org8200d52"><a href="https://open.spotify.com/track/0EcKn4nTp9tbdVtDsgMi07">Urself</a></h3>
</div>
<div id="outline-container-org620fd64" class="outline-3">
<h3 id="org620fd64"><a href="https://open.spotify.com/track/0DwOIUxbtZvWVLlqclMcA9">LOL</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<!-- copyright Ketan agrawal - on line below-->
<p>&copy; Ketan Agrawal, 2024. <a href="https://x.com/_ketan0">@_ketan0</a>.</p>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js"></script>
<script src="setup-theme-switcher.js"></script>
<script src="insert-intext-citation.js"></script>
</div>
</body>
</html>
